doc/org-mode/about.org
# vim: sw=2 ts=2 et ft=org
#+STYLE: <LINK href="stylesheet.css" rel="stylesheet" type="text/css">
#+TITLE: Nitrogen 2.x Documentation
#+AUTHOR: Rusty Klophaus (@rustyio)
#+EMAIL: 

#+TEXT: [[file:./index.org][Getting Started]] | [[file:./api.org][API]] | [[file:./elements.org][Elements]] | [[file:./actions.org][Actions]] | [[file:./validators.org][Validators]] | [[file:./handlers.org][Handlers]] | [[file:./config.org][Configuration Options]] | *About*
#+HTML: <div class=headline>About Nitrogen</div>

* Resources

  + NitrogenProject.com - http://nitrogenproject.com

  + Source Code - http://github.com/nitrogen/nitrogen

  + Donations - http://pledgie.com/campaigns/2057

  + Mailing List - http://groups.google.com/group/nitrogenweb
  
  + Bugs and Issues - http://github.com/nitrogen/nitrogen/issues

* Versions

  Nitrogen relies on some or all of the following software:

  + *Erlang R14B03* or later - http://erlang.org

  + *SimpleBridge* - Common interface to Erlang HTTP servers.
    - Git Repo: https://github.com/nitrogen/simple_bridge

  + *cowboy* - HTTP Server (Optional)
    - Git Repo: https://github.com/extend/cowboy

  + *mochiweb* - HTTP Server (Optional)
    - Git Repo: https://github.com/nitrogen/mochiweb

  + *webmachine* - HTTP Server (Optional)
    - Homepage: http://webmachine.basho.com 
    - Git Repo: https://github.com/basho/webmachine

  + *yaws* - HTTP Server (Optional)
    - Homepage: https://yaws.hyber.org
    - Git Repo: https://github.com/klacke/yaws 

  + *Sync* - Automatically recompile changed Erlang modules.
    - Git Repo: https://github.com/rustyio/sync

  + *jQuery 1.8.2* - http://jquery.com

  + *jQuery UI 1.8.23* - http://jqueryui.com

  + *jQuery Mobile 1.1.1* - http://jquerymobile.com

  + *Live Validation 1.3* - http://livevalidation.com/

  + jQuery File Upload 5.19* - https://github.com/blueimp/jQuery-File-Upload

* Thanks

  Sincere thanks to all the people who have helped make Nitrogen great, including:
   
  + Rusty Klophaus (@rustyio)
  + Chris Williams (@voodootikigod)
  + Joel Reymont (@wagerlabs)
  + Tom McNulty
  + Martin Scholl (@zeit\_geist)
  + Dave Peticolas
  + Jon Gretar Borgthorsson (@jongretar)
  + Dan Bravender (@dbravender)
  + Taavi Talvik
  + Torbjorn Tornkvist (@kruskakli)
  + Marius A. Eriksen (@marius)
  + Michael Mullis
  + John Dragos
  + Benjamin Nortier (@bjnortier)
  + Jay Doane
  + Robert Schonberger
  + Yurii Rashkovskii (@yrashk)
  + Ville Koivula
  + Jesse Gumm (@jessegumm)
  + Jan-Felix Wittmann
  + Martin Sivak
  + Markus Flambard
  + Jonas Ådahl
  + Boris Faure
  + Rajiv M. Ranganath
  + Gregory Haskins
  + Andy Skelton
  + Tino Breddin
  + Dave Peticolas
  + Susan Potter (@susanpotter)
  + Rado Kozmer
  + Ward Bekkar
  + Gleb Peregud
  + Lorant Kurthy
  + Andreas Hasselberg
  + Mattias Holmlund
  + Justin Kirby
  + Tuncer Ayaz
  + Loïc Hoguin (@lhoguin)
  + Sergei Lebedev
  + Stephen Panning
  + James Pharaoh
  + Milan Svoboda
  + Jenő I. Hajdu
  + Maxim Sokhatsky (@5HT)
  + Dmitriy Kargapolov
   
  Roughly sorted by date of contribution. Send your twitter handles to @jessegumm or @rustyio

* Documentation

  This documentation is created using org-mode. To contribute updates
  or corrections, contact Jesse Gumm (@jessegumm) or fork and
  update the code in http://github.com/nitrogen/nitrogen_core under the
  =./docs/org-mode= directory
